--[[TableMarqueeMessge.lua
--]]

TableMarqueeMessge= 
{
	{ id = 1.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 2.0, Desc = {{text="家族 "},{color = cc.c3b(255.0,198,0)},{text=" 刚刚创立了，欢迎大家积极加入。"}}, },
	{ id = 3.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 4.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 5.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 6.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 7.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 8.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 9.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 10.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 11.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 12.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 13.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 14.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 15.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 16.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 17.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
	{ id = 18.0, Desc = {{color = cc.c3b(59.0,255,59)},{text="先生你好，我是10086，你现在确定充值话费"},{color = cc.c3b(234,45,45)},{text="元吗？"},{text="我的工号"},{color = cc.c3b(255,255,255)}}, },
}
