
TableNetError = {

	e10000 = {
		Type = 1,
		Desc = "入口服务通用错误码",
	},

	e10001 = {
		Type = 1,
		Desc = "网络超时",
	},

	e10002 = {
		Type = 1,
		Desc = "请求参数错误",
	},

	e10003 = {
		Type = 1,
		Desc = "无效的验证码",
	},

	e10004 = {
		Type = 1,
		Desc = "无效的游戏代号",
	},

	e20000 = {
		Type = 1,
		Desc = "游戏服务通用错误码",
	},

	e20001 = {
		Type = 1,
		Desc = "操作超时",
	},

	e20002 = {
		Type = 3,
		Desc = "昵称已存在，请重新输入",
	},

	e20003 = {
		Type = 3,
		Desc = "昵称含有非法字符，请重新输入",
	},

	e20004 = {
		Type = 3,
		Desc = "金币不足",
	},

	e20005 = {
		Type = 3,
		Desc = "玉璧不足",
	},

	e20006 = {
		Type = 3,
		Desc = "材料不足",
	},

	e20007 = {
		Type = 3,
		Desc = "缺少材料数据",
	},

	e20008 = {
		Type = 3,
		Desc = "家族贡献度不足",
	},

	e20009 = {
		Type = 3,
		Desc = "荣誉值不足",
	},

	e20010 = {
		Type = 3,
		Desc = "体力不足",
	},

	e20011 = {
		Type = 3,
		Desc = "境界点不足",
	},

	e20012 = {
		Type = 3,
		Desc = "斗魂点不足",
	},

	e20020 = {
		Type = 2,
		Desc = "登陆认证失败",
	},

	e20100 = {
		Type = 3,
	},

	e20101 = {
		Type = 3,
		Desc = "背包已满，请购买更多的背包格子或出售多余的道具",
	},

	e20102 = {
		Type = 3,
		Desc = "装备品质不符合分解要求",
	},

	e20110 = {
		Type = 3,
		Desc = "此装备已经被镶嵌满了",
	},

	e20111 = {
		Type = 3,
		Desc = "不可镶嵌同类型宝石",
	},

	e20130 = {
		Type = 3,
		Desc = "装备已经是最大等级",
	},

	e20131 = {
		Type = 3,
		Desc = "人物身上没有此装备",
	},

	e20132 = {
		Type = 3,
		Desc = "缺少强化需要的材料数据",
	},

	e20140 = {
		Type = 3,
		Desc = "没有此商城",
	},

	e20141 = {
		Type = 3,
		Desc = "商城没有此物品",
	},

	e20150 = {
		Type = 3,
		Desc = "境界盘孔已经满了",
	},

	e20151 = {
		Type = 3,
		Desc = "已经镶嵌了同类型的境界丹",
	},

	e20152 = {
		Type = 3,
		Desc = "同类型的境界丹已经被吃光光啦",
	},

	e20153 = {
		Type = 3,
		Desc = "境界丹达到最大级",
	},

	e20154 = {
		Type = 3,
		Desc = "等级达到境界盘限制，请升级境界盘",
	},

	e20155 = {
		Type = 3,
		Desc = "达到角色等级限制，请升级角色等级",
	},

	e20156 = {
		Type = 3,
		Desc = "境界盘已经升到最高级了",
	},

	e20157 = {
		Type = 3,
		Desc = "境界盘经验不足，请先进行吞噬",
	},

	e20158 = {
		Type = 3,
		Desc = "境界升阶丹不足，请参加活动，获得更多的升阶丹再来",
	},

	e20160 = {
		Type = 3,
		Desc = "您没有这个美人图",
	},

	e20161 = {
		Type = 3,
		Desc = "今天的亲密次数已用尽，请您明天再来",
	},

	e20162 = {
		Type = 3,
		Desc = "亲密CD中，您先休息会儿",
	},

	e20163 = {
		Type = 3,
		Desc = "所有的美人图都唤醒了",
	},

	e20164 = {
		Type = 3,
		Desc = "人物等级不足无法解锁组合",
	},

	e20165 = {
		Type = 3,
		Desc = "这种美人图已经用光了",
	},

	e20170 = {
		Type = 3,
		Desc = "装备品质太高了",
	},

	e20171 = {
		Type = 3,
		Desc = "炼化队列已满，请加速完成已有的炼化任务",
	},

	e20172 = {
		Type = 3,
		Desc = "您已经拥有足够多的剑魂了，请先吞噬它们",
	},

	e20173 = {
		Type = 3,
		Desc = "炼化仍未完成",
	},

	e20174 = {
		Type = 3,
		Desc = "炼化已经完成了，请进行收取",
	},

	e20180 = {
		Type = 3,
		Desc = "您今日的挑战次数已用尽，请明日再来挑战。",
	},

	e20190 = {
		Type = 3,
		Desc = "查不到此装备的数据",
	},

	e20191 = {
		Type = 3,
		Desc = "您的碎片不足",
	},

	e20192 = {
		Type = 3,
		Desc = "您的图谱不足",
	},

	e20200 = {
		Type = 3,
		Desc = "技能已经升到顶级了",
	},

	e20201 = {
		Type = 3,
		Desc = "已经配置过这个技能了。",
	},

	e20210 = {
		Type = 3,
		Desc = "这个战灵已经上阵了",
	},

	e20211 = {
		Type = 3,
		Desc = "战灵上阵已满！请先撤下其他的战灵再试",
	},

	e20212 = {
		Type = 3,
		Desc = "您没有这个战灵",
	},

	e20213 = {
		Type = 3,
		Desc = "该战灵没有上阵",
	},

	e20214 = {
		Type = 3,
		Desc = "战灵已经达到最大等级了",
	},

	e20215 = {
		Type = 3,
		Desc = "战灵达到或者超过人物等级",
	},

	e20216 = {
		Type = 3,
		Desc = "战灵的品质已经满了",
	},

	e20217 = {
		Type = 3,
		Desc = "战灵碎片不足",
	},

	e20220 = {
		Type = 3,
		Desc = "鼓舞已达上限",
	},

	e20230 = {
		Type = 3,
		Desc = "您输入的昵称有误，查不到此玩家",
	},

	e20231 = {
		Type = 3,
		Desc = "他已经是您的好友了",
	},

	e20232 = {
		Type = 3,
		Desc = "您的好友人数已达上限",
	},

	e20233 = {
		Type = 3,
		Desc = "对方好友列表已达上限",
	},

	e20250 = {
		Type = 3,
		Desc = "活跃宝箱已经被领取了",
	},

	e20251 = {
		Type = 3,
		Desc = "活跃度不足",
	},

	e20260 = {
		Type = 3,
		Desc = "没有正在销售的酒类",
	},

	e20261 = {
		Type = 3,
		Desc = "现在您还不能收账",
	},

	e20262 = {
		Type = 3,
		Desc = "金币不足",
	},

	e20263 = {
		Type = 3,
		Desc = "您今天的喝酒次数已用尽",
	},

	e20264 = {
		Type = 3,
		Desc = "您的等级不足，无法售卖此酒类",
	},

	e20270 = {
		Type = 3,
		Desc = "您的权限不足",
	},

	e20271 = {
		Type = 3,
		Desc = "此玩家已经加入家族了",
	},

	e20272 = {
		Type = 3,
		Desc = "此职位人数已达上限",
	},

	e20273 = {
		Type = 3,
		Desc = "此玩家不在家族中",
	},

	e20274 = {
		Type = 3,
		Desc = "您作为家族之长，不能抛弃大家直接退出家族。\n您可以先将族长转让给他人后再尝试退出家族。",
	},

	e20275 = {
		Type = 3,
		Desc = "家族建设度不足",
	},

	e20276 = {
		Type = 3,
		Desc = "家族已满员，不能添加更多的人员",
	},

	e20277 = {
		Type = 3,
	},

	e20278 = {
		Type = 3,
		Desc = "捐献次数已达今日上限",
	},

	e20279 = {
		Type = 3,
		Desc = "家族没有族长",
	},

	e20280 = {
		Type = 3,
		Desc = "家族名称长度不符合要求",
	},

	e20281 = {
		Type = 3,
		Desc = "家族名称非法",
	},

	e20282 = {
		Type = 3,
		Desc = "家族宗旨长度不符合要求",
	},

	e20283 = {
		Type = 3,
		Desc = "家族宗旨非法",
	},

	e20284 = {
		Type = 3,
		Desc = "家族名称已经存在",
	},

	e20285 = {
		Type = 3,
		Desc = "家族不存在",
	},

	e20286 = {
		Type = 3,
		Desc = "家族已达到最大等级",
	},

	e20287 = {
		Type = 3,
		Desc = "不能将自己开除出家族",
	},

	e20288 = {
		Type = 3,
		Desc = "不能任命自己",
	},

	e20289 = {
		Type = 3,
		Desc = "家族研究院仍未开启",
	},

	e20290 = {
		Type = 3,
		Desc = "家族研究院已达满级了",
	},

	e20291 = {
		Type = 3,
		Desc = "家族等级不足",
	},

	e20292 = {
		Type = 3,
		Desc = "家族建设度不足",
	},

	e20293 = {
		Type = 3,
		Desc = "家族资金不足",
	},

	e20294 = {
		Type = 3,
		Desc = "此家族科技已激活",
	},

	e20295 = {
		Type = 3,
		Desc = "家族科技同时存在数已达上限，请升级研究所等",
	},

	e20296 = {
		Type = 3,
		Desc = "家族科技已经满级了",
	},

	e20297 = {
		Type = 3,
		Desc = "家族研究院等级不足",
	},

	e20298 = {
		Type = 3,
		Desc = "对方处于CD中，无法添加",
	},

	e20300 = {
		Type = 3,
		Desc = "竞技场次数不足",
	},

	e20301 = {
		Type = 3,
		Desc = "免死符不足，暂时无法逃过此劫",
	},

	e20401 = {
		Type = 3,
		Desc = "没有这封邮件",
	},

	e20402 = {
		Type = 3,
		Desc = "邮件附件已领取",
	},

	e20403 = {
		Type = 3,
		Desc = "邮件附件未领取",
	},

	e30000 = {
		Type = 1,
		Desc = "账号服务通用错误码",
	},

	e30001 = {
		Type = 1,
		Desc = "请求参数错误",
	},

	e30002 = {
		Type = 1,
		Desc = "数据库操作错误",
	},

	e30003 = {
		Type = 1,
		Desc = "未找到deviceid",
	},

	e30004 = {
		Type = 1,
		Desc = "操作超时",
	},

	e40000 = {
		Type = 1,
		Desc = "数据库服务器通用错误码",
	},

}


